import sys
import random
import itertools as it
sys.path.append("..\\..")
from note import *
from gen import *
import aff

random.seed(1114)

chart = [timing(0, 128, 4)]
cd.bpm = 128.0
T = cd.tempo2t
Tf = cd.tempo2tf
DT = cd.tempo2dt
DTf = cd.tempo2dtf

########################################
# 前奏

chart.extend(notes(
    put_arctaps(    # pattern: (2 1 1 1 1 1 1 1 ) * 8
        batch_taps(t_repeat(T(2),T(10),DTf(0,0.5)),
                4,1,3,2,3,2,4,1,
            (1,4),3,2,4,4,2,3,1,
            (1,4),3,2,1,1,2,3,4,
            (1,4),2,3,4,4,3,2,1,
            (1,-1),-1,2,4,2,3,1,4,
            (4,-1),-1,3,1,3,2,4,1,
            (1,-1),-1,2,3,1,2,3,4,
            (4,-1),-1,3,2,4,3,2,1,
        ),
        notes(swing(T(5),T(10),DT(1), two_corners, black=True))
    ),
    arc(T(9,1),T(9,3.5), (0,1),(1,1), 's'),

########################################
# 我从不相信 时间能愈合所有的伤

    arc(T(10),T(10), (0,1),(1,1), 's', black=True),
    put_arctaps(
        it.chain( # 随机单双海
            notes((T(10), -1), (T(10), 4)),
            rand_sky_floor_taps(t_repeat(T(10,1),T(14),DTf(0,1)), 2),
            rand_taps(t_repeat(Tf(10,1.5),T(14),DTf(0,1)), 0),
        ),
        double(swing(T(10),T(14),DTf(0,1), two_corners, black=True))
    ),

########################################
# 它只不过 是这麻木世界 对你拒绝妥协的症状开的一副毒药

    collection(
        snake([     # 它 只 不 过
            (T(14,i+1), [(1,1),(1,1),(0,1),(0,1)][i], 'sisi'),
            (T(14,i+1.5), [(0,0),(0,0.5),(1,1),(0.5,0.7)][i], 's'),
            (T(14,i+2) if i < 3 else T(16,0.5),)
        ], color=(i+1)%2)
        for i in range(4)
    ),
    arc(T(15,0.5),T(15,1), (0.5,0.7),(1,1), 'soso', black=True,
        arctaps=[T(15,1)]), # 是
    (T(15,1.5), 4), # 这
    (T(15,2.0), 3), # 麻
    (T(15,2.5), 2), # 木
    (T(15,3.0), 1), # 世
    (T(15,3.5), 2), # 界
    put_arctaps(
        notes(
            (T(16,1.0), -1), # 对
            (T(16,1.5),  3), # 你
            (T(16,2.0), -1), # 拒
            (T(16,2.5),  4), # 绝
            (T(16,3.0), -1), # 妥
            (T(16,3.5),  2), # 协
            (T(17,0.0),  3), # 的
            (T(17,0.5), -1), # 症
            (T(17,0.75), 1), # 状
            (T(17,1.5),  4), # 开
            (T(17,1.75),-1), # 的
            (T(17,2.5), -1), # 一
            (T(17,2.75), 1), # 副
            (T(17,3.5), -1), # 毒
            (T(17,3.75), 4), # 药
        ),
        notes(snake([
            (T(16,0.5), (0.5,1), 's'),
            (T(16,1.0), 'si'),  # 对
            (T(16,1.5), (1,1), 'b'),
            (T(16,2.25),(0,1)), # 拒
            (T(16,3.0), (1,1)), # 妥
            (T(16,3.25),),
            (T(17,0.0), (0,1)),
            (T(17,0.25),),      # 症
            (T(17,1.0), (1,1)),
            (T(17,1.25),),      # 的
            (T(17,2.0), (0,1)),
            (T(17,2.25),),      # 一
            (T(17,3.0), (1,1)),
            (T(17,3.25),),      # 毒
            (T(17,4.0), (0,1)),
        ], black=True))
    ),

########################################
# 我也不知道 宽容有什么值得赞扬
# 以德报怨 莫非你以为退让 真能叩开天堂

    repeat(2, DT(0,0.5), repeat(2, 5,   # virtual taps for the first beat
        double(arc(T(18),T(18), (-0.45,-0.2),(-0.05,-0.2), black=True))
    )),
    put_arctaps(
        batch_taps(
            it.chain(
                t_repeat_n( # pattern: (2 2 111 ) * 12
                    (Tf(18),Tf(18,0.5),Tf(18,1),Tf(18,1.25),Tf(18,1.5)),
                12, DTf(0,2)),
            ),
            (   ),(   ),2,-1,2, #M
            (1,4),(1,4),3,-1,3, #M
            (2,4),(2,4),1,-1,1, #M
            (1,3),(1,3),4,-1,4, #M
            (1,-2),(1,-2),2,3,2,#R
            (4,-2),(4,-2),3,2,3,#L
            (2,-2),(2,-2),1,2,1,#R
            (3,-2),(3,-2),4,3,4,#L
            (-1,-2),(-1,-2),-1,3,-1,#ML
            (-1,-2),(-1,-2),-1,2,-1,#MR
            (-1,-2),(-1,-2),-1,4,-1,#ML
            (-1,-2),(-1,-2),-1,1,-1,#MR
        ),
        double(swing(T(18,0.5),T(24,0.5),DTf(0,2), two_corners, black=True))
    ),
    put_arctaps(
        batch_taps(
            it.chain(
                t_repeat(T(24), T(25), DTf(0,0.5)), # 单双海
                t_repeat(T(25), Tf(25,2), DTf(0,0.25)), # 交互
            ),
            (2,3),-1, # 你
            (2,3),-2, # 以
            (2,3),-1, # 为
            (2,3),-2, # 退
            -1,-2, -1,-2, -1,-2, -1,-2,
        ),
        double(
            snake([
                (T(24,0.5), (0,1)),
                (T(25,0), 'so'),
                (T(25,2), (0.5,1)),
            ], black=True)
        )
    ),
    collection(      # 叩 开 天 堂
        arc(T(25,2+i*0.5),T(25,2.5+i*0.5), (i/3,1),(i/3,0), 'sisi', color=i%2)
        for i in range(4)
    ),

########################################
# 偶尔也会想要遗忘 是谁在我身上刻下了触目惊心的伤
# 然而还是无法面对 无知却无情的阳光

    # pattern: 2h 1t2h 2t1t


))

aff.save_file('2.aff', chart)
